projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/Водители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Водители</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелЗагр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелЗагр2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтранаОформления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/Водители/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВключитьОтборПоВодителю();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы <> Неопределено Тогда
		Если ЭтаФорма.ВладелецФормы.Имя = "СписокВыбора" Тогда
			Элементы.Владелец.Видимость = Ложь;
		Иначе
			Элементы.Владелец.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;

	ТекФамилия 	= Объект.Фамилия;
	ТекИмя 		= Объект.Имя;
	ТекОтчество = Объект.Отчество;
	
	УправлениеДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Фамилия) И (НЕ ФИОЗаполненКорректно(Объект.Фамилия)) Тогда
		ПоказатьПредупреждение(, "Фамилия должна состоять из букв русского или английского алфавитов");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Имя) И (НЕ ФИОЗаполненКорректно(Объект.Имя)) Тогда
		ПоказатьПредупреждение(, "Имя должно состоять из букв русского или английского алфавитов");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Отчество) И (НЕ ФИОЗаполненКорректно(Объект.Отчество)) Тогда
		ПоказатьПредупреждение(, "Отчество должно состоять из букв русского или английского алфавитов");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Наименование) И (НЕ ФИОЗаполненКорректно(Объект.Наименование)) Тогда
		ПоказатьПредупреждение(, "ФИО должно состоять из букв русского или английского алфавитов");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НомерТелефона) И (НЕ ТелефонЗаполненКорректно(Объект.НомерТелефона)) Тогда
		ПоказатьПредупреждение(, "Номер телефона (для SMS) должен содержать только цифры");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ТелЗагр1) И (НЕ ТелефонЗаполненКорректно(Объект.ТелЗагр1)) Тогда
		ПоказатьПредупреждение(, "Номер телефона (Загр.1) должен содержать только цифры");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ТелЗагр2) И (НЕ ТелефонЗаполненКорректно(Объект.ТелЗагр2)) Тогда
		ПоказатьПредупреждение(, "Номер телефона (Загр.2) должен содержать только цифры");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ВключитьОтборПоВодителю();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УправлениеДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанаУчетнаяЗаписьМессенджера" Тогда
		Если Источник = Объект.Ссылка И Параметр.Водитель <> Объект.Ссылка Тогда  //изменили водителя в учетке
			Объект.ОсновнойМессенджер 	= Неопределено;
			Модифицированность 			= Истина;
		ИначеЕсли Параметр.Водитель = Объект.Ссылка И (НЕ ЗначениеЗаполнено(Объект.ОсновнойМессенджер)) Тогда
			Объект.ОсновнойМессенджер 	= Параметр.УчетнаяЗапись;
			Модифицированность 			= Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	ПриИзмененииФамилии();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	ПозицииПробелов = ОпределитьПозицииПробелов();

	Если ПозицииПробелов[0] > 0 И ПозицииПробелов[1] > 0 Тогда
	
		ИмяИзНаименования = Сред(Объект.Наименование, (ПозицииПробелов[0] + 1), (ПозицииПробелов[1] - ПозицииПробелов[0] - 1));
		
		Если ИмяИзНаименования <> ТекИмя И НЕ ПустаяСтрока(ИмяИзНаименования) Тогда
		
			ТекИмя = СокрЛП(Объект.Имя);
			Возврат;
		
		КонецЕсли;

		Объект.Наименование = Сред(Объект.Наименование, 1, ПозицииПробелов[0]) + СокрЛП(Объект.Имя) + Сред(Объект.Наименование, ПозицииПробелов[1]);
		
	ИначеЕсли ПозицииПробелов[0] > 0 Тогда

		ИмяИзНаименования = Сред(Объект.Наименование, (ПозицииПробелов[0] + 1));

		Если ИмяИзНаименования <> ТекИмя И НЕ ПустаяСтрока(ИмяИзНаименования) Тогда
		
			ТекИмя = СокрЛП(Объект.Имя);
			Возврат;
		
		КонецЕсли; 

		Объект.Наименование = Сред(Объект.Наименование, 1, ПозицииПробелов[0]) + СокрЛП(Объект.Имя);
		
	Иначе

		Если НЕ ПустаяСтрока(Объект.Наименование) Тогда
		
			Объект.Наименование = Объект.Наименование + " " + СокрЛП(Объект.Имя);
		
		Иначе

			Объект.Наименование = " " + СокрЛП(Объект.Имя);
		
		КонецЕсли; 
		
	КонецЕсли;
	
	ТекИмя = СокрЛП(Объект.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	ПозицииПробелов = ОпределитьПозицииПробелов();

	Если ПозицииПробелов[1] > 0 Тогда
	
		ОтчествоИзНаименования = Сред(Объект.Наименование, (ПозицииПробелов[1] + 1));
		
		Если ОтчествоИзНаименования <> ТекОтчество И НЕ ПустаяСтрока(ОтчествоИзНаименования) Тогда
		
			ТекОтчество = СокрЛП(Объект.Отчество);
			Возврат;
		
		КонецЕсли;

		Объект.Наименование = Сред(Объект.Наименование, 1, ПозицииПробелов[1]) + СокрЛП(Объект.Отчество);
		
	Иначе

		Если НЕ ПустаяСтрока(Объект.Наименование) Тогда
		
			Объект.Наименование = Объект.Наименование + " " + СокрЛП(Объект.Отчество);
		
		Иначе

			Объект.Наименование = "  " + СокрЛП(Объект.Отчество);
		
		КонецЕсли; 
		
	КонецЕсли;
	
	ТекОтчество = СокрЛП(Объект.Отчество);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПаспортаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	Объект.РеквизитыПаспорта = ВРЕГ(Текст);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Функция определяет номера позиций пробелов в строке реквизита Наименование
//
// Параметры
//  НЕТ
//
// Возвращаемое значение
//  Массив, числа - позиции пробелов в строке
//
Функция ОпределитьПозицииПробелов()

	Пробелы = Новый Массив;

	Для а = 1 По 2 Цикл
	
		Пробелы.Добавить(0);
	
	КонецЦикла; 
	
	КолПробелов = 0;
	
	Для а = 1 По СтрДлина(Объект.Наименование) Цикл
	
		Если Сред(Объект.Наименование, а, 1) = " " Тогда

			Пробелы[КолПробелов] = а;
			КолПробелов = КолПробелов + 1;
		
		КонецЕсли; 

		Если КолПробелов = 2 Тогда
		
			Прервать;
		
		КонецЕсли; 
		
	КонецЦикла; 

	Возврат Пробелы;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииФамилии()

	ПозицииПробелов = ОпределитьПозицииПробелов();

	Если ПозицииПробелов[0] > 0 Тогда
	
		ФамилияИзНаименования = Сред(Объект.Наименование, 1, (ПозицииПробелов[0] - 1));
		
		Если ФамилияИзНаименования <> ТекФамилия И НЕ ПустаяСтрока(ФамилияИзНаименования) Тогда
		
			ТекФамилия = СокрЛП(Объект.Фамилия);
			Возврат;
		
		КонецЕсли;

		Объект.Наименование = СокрЛП(Объект.Фамилия) + Сред(Объект.Наименование, ПозицииПробелов[0]);
		
	Иначе

		Если ПустаяСтрока(Объект.Наименование) Тогда
			
			Объект.Наименование = СокрЛП(Объект.Фамилия);
		
		Иначе

			Если СокрЛП(Объект.Наименование) = ТекФамилия Тогда
			
				Объект.Наименование = СокрЛП(Объект.Фамилия);
		
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ТекФамилия = СокрЛП(Объект.Фамилия);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностью()
	
	Элементы.МессенджерыВодителя.Доступность = (НЕ Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура ВключитьОтборПоВодителю()
	
	СсылкаНаОбъект = Объект.Ссылка;
	
	//МессенджерыВодителя
	ДоработкиОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		МессенджерыВодителя.Отбор,
		"Владелец",
		СсылкаНаОбъект,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина
	);
	
КонецПроцедуры

&НаКлиенте
Функция ТелефонЗаполненКорректно(пНомерТелефона) Экспорт

	Для Сч = 1 По СтрДлина(пНомерТелефона) Цикл
		пСимвол = Сред(пНомерТелефона, Сч, 1);
		Если Найти("+0123456789", пСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

&НаКлиенте
Функция ФИОЗаполненКорректно(пФИО) Экспорт

	Для Сч = 1 По СтрДлина(пФИО) Цикл
		пСимвол = Сред(пФИО, Сч, 1);
		Если Найти("АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЬЪЭЮЯABCDEFGHIJKLMNOPQRSTUVWXYZАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЧШЩЬЮЯ' -.", ВРег(пСимвол)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

#КонецОбласти
